
        ### Terraform Plan Result
        ```hcl
        module.infrastructure.data.http.myip: Reading...
module.infrastructure.data.http.myip: Read complete after 0s [id=https://ifconfig.me/ip]
module.infrastructure.aws_vpc.vpc: Refreshing state... [id=vpc-06e080e014ed4da11]
module.infrastructure.aws_subnet.mgmt: Refreshing state... [id=subnet-0e3146c08ea4cc282]
module.infrastructure.aws_subnet.internal: Refreshing state... [id=subnet-03173512f3888337a]
module.infrastructure.aws_subnet.external: Refreshing state... [id=subnet-00ace715dde057df4]
module.infrastructure.aws_internet_gateway.default: Refreshing state... [id=igw-0aafff320da9a3963]
module.infrastructure.aws_security_group.external: Refreshing state... [id=sg-0dc5a69207ae44abe]
module.infrastructure.aws_security_group.internal: Refreshing state... [id=sg-0d7e291ad38f10ed2]
module.infrastructure.aws_security_group.mgmt: Refreshing state... [id=sg-0b38e7f68f58b10ca]
module.infrastructure.aws_security_group.webserver: Refreshing state... [id=sg-0a5ef87b1c8d50b4b]
module.infrastructure.aws_route_table_association.route_table_external: Refreshing state... [id=rtbassoc-017278adb84acea20]
module.infrastructure.aws_route_table_association.route_table_internal: Refreshing state... [id=rtbassoc-0ae8eb57f3376ab39]
module.infrastructure.aws_route.internet_access: Refreshing state... [id=r-rtb-0c150d2bc69b5a86d1080289494]
module.infrastructure.aws_network_interface.mgmt: Refreshing state... [id=eni-07b43b0904005d524]
module.infrastructure.aws_network_interface.external: Refreshing state... [id=eni-0f8c0b8ba729e42b8]
module.infrastructure.aws_network_interface.internal: Refreshing state... [id=eni-062bd0b113d785ed2]
module.infrastructure.aws_instance.webserver_2: Refreshing state... [id=i-06b0f3e232fade861]
module.infrastructure.aws_instance.webserver_1: Refreshing state... [id=i-0ce9ba504f1fb6d03]
module.infrastructure.aws_eip.eip_mgmt: Refreshing state... [id=eipalloc-01af114a40b88aa6d]
module.infrastructure.aws_eip.eip_vip: Refreshing state... [id=eipalloc-0fbc382f25acf4de1]
module.infrastructure.aws_instance.big_ip: Refreshing state... [id=i-019acb25ddb96c6f2]
module.infrastructure.null_resource.wait_for_bigip_http: Refreshing state... [id=6699087683713957136]
module.configuration.bigip_net_vlan.external: Refreshing state... [id=external]
module.configuration.bigip_net_vlan.internal: Refreshing state... [id=internal]
module.configuration.bigip_net_selfip.internal_selfip: Refreshing state... [id=10.0.11.10]
module.configuration.bigip_net_selfip.external_selfip: Refreshing state... [id=10.0.12.10]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.infrastructure.aws_instance.webserver_1 must be replaced
-/+ resource "aws_instance" "webserver_1" {
      ~ arn                                  = "arn:aws:ec2:us-west-1:089622251853:instance/i-0ce9ba504f1fb6d03" -> (known after apply)
      ~ availability_zone                    = "us-west-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0ce9ba504f1fb6d03" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0a0284a94ae1ca107" -> (known after apply)
      ~ private_dns                          = "ip-10-0-12-101.us-west-1.compute.internal" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "54.176.195.93" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0a5ef87b1c8d50b4b",
        ]
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Environment" = "lab"
            "Name"        = "webserver_1"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0a5ef87b1c8d50b4b",
        ] -> (known after apply)
        # (11 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
          
        ```

        _This is an automated dry run result._
        